In [1]:
# Load library
import pandas as pd

In [2]:
# Create data frame
dataframe = pd.DataFrame()

In [4]:
# Create datetimes
dataframe['date'] = pd.date_range('1/1/2001', periods=100000, freq='h')

In [5]:
# Select observations between two datetimes
dataframe[(dataframe['date'] > '2002-1-1 01:00:00') &
(dataframe['date'] <= '2002-1-1 04:00:00')]

                    date
8762 2002-01-01 02:00:00
8763 2002-01-01 03:00:00
8764 2002-01-01 04:00:00

In [6]:
# Set index
dataframe = dataframe.set_index(dataframe['date'])

In [7]:
# Select observations between two datetimes
dataframe.loc['2002-1-1 01:00:00':'2002-1-1 04:00:00']

                                   date
date
2002-01-01 01:00:00 2002-01-01 01:00:00
2002-01-01 02:00:00 2002-01-01 02:00:00
2002-01-01 03:00:00 2002-01-01 03:00:00
2002-01-01 04:00:00 2002-01-01 04:00:00